Autodesk.Revit.DB.ParameterType.Stationing
The data value will be represented as infrastructure stationing

Autodesk.Revit.DB.ParameterType.Speed
The data value will be represented as a Speed

Autodesk.Revit.DB.ParameterType.TimeInterval
The data value will be represented as a TimeInterval

Autodesk.Revit.DB.ParameterType.Custom
The data value will be represented by a non-enumerated spec identified by a `ForgeTypeId`.